SELECT K.[期_計算対象] AS 予測ターゲット, T.[施工管轄組織名], T.[受注月], Sum(T.[実績価格] * K.[加重率]) AS 加重集計値
FROM (SELECT [受注期], [施工管轄組織名], [受注月], Sum([工事価格]) AS 実績価格
        FROM [at_Icube_累計]
        WHERE [施工管轄組織名] IN ('青森ＲＮ（作）', '秋田ＲＮ（作）', '盛岡ＲＮ（作）', '山形ＲＮ（作）', '福島ＲＮ（作）', '仙台ＲＮ（作）')
        GROUP BY [受注期], [施工管轄組織名], [受注月]
    )  AS T INNER JOIN (SELECT [作業所名], [期_計算対象], Val(Replace([期_荷重対象],'期','')) AS 荷重期, [加重率]
        FROM [at_受注額予測計数]
    )  AS K ON (T.[施工管轄組織名] = K.[作業所名]) AND (T.[受注期] = K.[荷重期])
GROUP BY K.[期_計算対象], T.[施工管轄組織名], T.[受注月]
ORDER BY K.[期_計算対象], T.[施工管轄組織名], T.[受注月];
