SELECT IIf(Month([対象年月])>=4, Year([対象年月])-2012, Year([対象年月])-2013) & "期" AS 期, 
       Choose(Month([対象年月]), "4Q", "4Q", "4Q", "1Q", "1Q", "1Q", "2Q", "2Q", "2Q", "3Q", "3Q", "3Q") AS Q, 
       Month([対象年月]) & "月" AS 月, 
       作業所名, 工事コード, 工事名, 社員名, 
       Sum([金額]) AS 集計金額
FROM at_Work_給与経費集計_結果
WHERE 工事コード <> 'EE0000100'
GROUP BY IIf(Month([対象年月])>=4, Year([対象年月])-2012, Year([対象年月])-2013) & "期", 
         Choose(Month([対象年月]), "4Q", "4Q", "4Q", "1Q", "1Q", "1Q", "2Q", "2Q", "2Q", "3Q", "3Q", "3Q"), 
         Month([対象年月]) & "月", 
         作業所名, 工事コード, 工事名, 社員名, 対象年月
ORDER BY 対象年月, 工事コード, 社員名;
